albert
's
cabbage
patch
has
some
rows
of
.
in
each
row
,
there
are
n0
heads
how
many
does
he
have
if
n1
all
?
marie
can
bike
at
a
speed
miles
an
hour
hours
she
take
to
tammy
drove
did
drive
cover
it
takes
apples
make
pie
pies
john
used
frank
worked
day
for
days
work
stephanie
went
the
store
times
last
month
buys
oranges
time
goes
buy
sarah
boxes
box
holds
martin
crayons
bottle
caps
paula
peanuts
diana
erasers
shares
them
among
friends
friend
get
harold
split
between
people
her
class
and
kept
left
overs
classmate
victor
skittles
ted
candy
bars
wants
put
into
bags
so
same
number
bag
should
go
martha
bought
small
cakes
children
would
like
divide
that
child
gets
amount
billy
eaten
by
hippopotamus
will
pamela
starts
with
jean
away
end
katherine
melissa
norma
bananas
loses
willie
stickers
gives
emily
got
more
from
half
price
won
mach
aaron
doris
handed
him
sheets
paper
had
only
remaining
found
cards
room
initially
karen
originally
evelyn
christo
students
playing
ground
owing
bad
health
were
jeffrey
collection
just
present
beginning
eric
ate
is
now
henry
thomas
picks
school
planning
field
trip
bus
decided
not
principal
asked
leave
brenda
which
jack
picked
sue
mother
made
cookies
niece
places
received
his
father
adds
attend
alice
collected
marbles
these
added
add
carol
give
mrs.
hilt
baked
weekend
holiday
dinner
this
bake
cereal
cups
kathy
books
minute
few
already
ernest
jennifer
hides
hidden
carlos
eat
pick
out
isabella
hair
inches
long
haircut
much
cut
off
arrange
serving
servings
whole
weighs
pounds
book
could
fill
up
seats
on
buses
needed
groups
be
created
steven
sold
lemon
chalet
cremes
cases
need
hold
tagalongs
pickup
cookie
mom
jenny
trefoils
plus
extra
deliver
gumballs
come
packages
nathan
shirley
do-si-dos
contains
louis
julian
writing
comic
story
frames
exactly
page
pages
contain
altogether
johns
read
chapters
measured
distance
desk
water
fountain
was
feet
walked
trips
today
ellen
garage
sale
chairs
worth
dollars
chair
cost
walk
money
spend
far
rate
first
week
family
vacation
car
mph
they
camped
campground
after
traveling
their
home
brett
every
perfect
score
points
you
games
brian
per
gallon
gallons
gas
travel
cap
costs
$
do
total
banana
ticket
tickets
michelle
candies
pencils
took
what
needs
share
equally
person
divided
student
beverly
organized
big
group
peter
stored
must
inviting
party
jesse
eggs
elizabeth
card
harry
deborah
diane
louise
michael
blocks
lori
bonnie
joyce
grapes
larry
rachel
removes
jar
debra
virginia
amy
edward
phillip
david
jane
rogers
sells
roger
jonathan
lost
joshua
dennis
patricia
marvin
ruby
craig
steve
patrick
wayne
heather
jose
ralph
rebecca
another
sean
find
tina
janet
ruth
finds
russell
brings
helen
ann
william
dorothy
wins
game
sara
gains
bet
steals
theresa
bridget
gave
started
borrows
gifted
pack
brought
cars
trucks
jeff
start
fish
tank
ben
begin
daniel
noodles
tommy
balloons
sister
then
todd
gum
pieces
connie
juan
carla
together
my
dog
bones
i
buried
lillian
clarence
eugene
taken
pile
table
susan
removed
herselves
down
birthday
stole
shared
dug
ofriend
house
joined
year
grow
jovana
shells
bucket
sheridan
cats
riding
stop
misha
earn
birds
sitting
tree
fly
flew
robin
brother
kelly
pigs
barn
join
came
rosa
flowers
andre
adolfo
tower
megan
seashells
linda
puts
inside
lindu
bring
placed
hayley
meatballs
plate
kirsten
steal
isha
pencil
sharpens
sharpen
franklin
valentines
mikey
leaves
blew
nell
collects
baseball
nintendo
ends
philip
sell
lose
eats
ferris
wheel
paradise
park
seat
ride
required
butterflies
butterfly
black
dots
cup
ounces
your
having
pizza
pizzas
slices
ronald
kathleen
kimberly
bubble
piece
cents
fifth
grade
play
been
equal
chocolates
bob
drives
kilometers
weight
weigh
charles
christine
gary
wanda
carried
office
market
dancing
auditorium
injury
managed
guitars
luc
hime
jasmin
tthe
before
late
receive
n0
n1
<UNK>
