mrs.
hilt
baked
pies
last
weekend
for
a
holiday
dinner
.
she
apples
if
wants
to
arrange
all
of
the
in
rows
each
,
how
many
will
have
?
needs
share
$
equally
among
total
people
much
money
person
get
bag
contains
pounds
oranges
are
bags
isabella
's
hair
is
inches
long
by
end
year
her
did
grow
gets
haircut
and
now
got
cut
off
sarah
had
some
trucks
gave
jeff
has
left
start
with
michael
fish
his
tank
ben
him
more
he
begin
wanda
blocks
theresa
gives
does
joyce
starts
larry
rachel
removes
bottle
caps
from
jar
there
were
originally
debra
virginia
eggs
amy
takes
away
box
harry
edward
phillip
david
pencils
eric
jane
crayons
eaten
hippopotamus
roger
candies
stephanie
jonathan
marie
erasers
loses
paula
melissa
bananas
shares
joshua
cards
dennis
stickers
carlos
patricia
albert
marvin
ernest
jennifer
diana
ruby
emily
craig
skittles
steve
patrick
brian
wayne
billy
pamela
jean
katherine
john
norma
willie
aaron
doris
charles
karen
evelyn
christine
helen
gary
ruth
peter
jesse
heather
jose
ralph
peanuts
jack
marbles
rebecca
sean
tina
janet
finds
another
russell
ann
william
buys
dorothy
harold
sara
daniel
noodles
only
hayley
meatballs
on
plate
kirsten
stole
steal
jovana
shells
bucket
added
add
isha
pencil
sharpens
it
sharpen
sheridan
cats
need
franklin
valentines
students
give
children
riding
bus
at
stop
then
altogether
misha
dollars
earn
birds
sitting
tree
fly
up
flew
robin
pieces
gum
brother
tommy
balloons
mom
birthday
mikey
leaves
blew
kelly
pick
todd
nell
collects
baseball
nintendo
games
so
that
connie
juan
pigs
barn
come
join
them
came
rosa
flowers
andre
adolfo
made
tower
megan
seashells
find
collection
carla
bought
together
my
dog
bones
dug
initially
carol
beginning
lillian
collected
number
father
clarence
tickets
eugene
pile
table
susan
desk
present
few
bridget
henry
linda
puts
inside
lindu
put
brenda
alice
buy
read
books
book
chapters
measured
distance
water
fountain
was
feet
walk
trips
goes
times
today
ellen
went
garage
sale
chairs
chair
cost
spend
cabbage
patch
row
heads
can
bike
speed
miles
an
hour
far
hours
tammy
drove
rate
drive
make
pie
take
you
cookies
want
would
reading
pages
same
night
finish
days
cereal
holds
cups
serving
servings
whole
weighs
sue
mother
could
fill
frank
worked
first
week
work
family
vacation
car
mph
they
camped
campground
after
traveling
their
home
brett
every
perfect
score
points
per
gallon
trip
used
gallons
gas
travel
cap
costs
do
child
banana
ticket
michelle
boxes
store
month
time
martin
kimberly
ronald
kathleen
school
planning
field
seats
buses
needed
betty
stored
must
go
class
divided
student
beverly
organized
into
groups
big
group
jeffrey
split
be
created
martha
inviting
friends
party
friend
elizabeth
card
kathy
candy
deborah
diane
louise
lori
bonnie
steven
sold
lemon
chalet
cremes
cases
hold
tagalongs
pickup
cookie
between
kept
overs
classmate
victor
jenny
trefoils
plus
extra
deliver
gumballs
packages
nathan
ate
eat
shirley
do-si-dos
louis
butterflies
butterfly
black
dots
bubble
piece
cents
fifth
grade
play
been
out
ferris
wheel
paradise
park
seat
ride
garden
columns
bean
plans
plants
your
having
pizza
pizzas
slices
ted
bars
should
chocolates
small
cakes
like
divide
amount
julian
writing
comic
story
frames
exactly
page
bob
kilometers
cup
ounces
cover
day
half
price
won
mach
handed
sheets
paper
remaining
found
room
christo
playing
ground
owing
bad
health
just
thomas
picks
decided
not
principal
asked
leave
which
picked
niece
places
received
adds
attend
these
this
bake
minute
already
hides
hidden
contain
johns
walked
worth
took
what
grapes
rogers
sells
lost
brings
wins
game
gains
bet
steals
started
borrows
gifted
pack
brought
cars
sister
i
buried
taken
removed
herselves
down
shared
ofriend
house
joined
bring
placed
ends
philip
sell
lose
eats
required
equal
drives
weight
weigh
carried
office
market
dancing
auditorium
injury
managed
guitars
luc
hime
jasmin
tthe
before
late
receive
n0
n1
<UNK>
