<UNK>
<NR>
carla
has
some
marbles
she
bought
134
now
187
how
many
did
start
with
scott
4
tickets
ernest
9
finds
another
72
does
end
joe
had
50
toy
cars
if
he
gets
12
more
will
have
then
there
were
originally
57
apples
in
the
jar
debra
removes
22
from
a
are
left
larry
starts
93
stickers
loses
6
mrs
sheridan
17
cats
mr
gave
her
14
altogether
cheryl
8
skittles
kathryn
gives
89
steve
46
oranges
shares
patrick
64
children
riding
on
bus
at
stop
got
78
27
eggs
david
7
melissa
70
john
takes
19
away
andrew
buys
62
hayley
25
meatballs
plate
kirsten
stole
of
11
steal
ralph
74
peanuts
59
brenda
shirley
98
jane
87
crayons
eaten
by
hippopotamus
88
candies
box
lisa
18
bag
diana
out
robin
pieces
gum
brother
44
all
robin's
give
pamela
to
karen
kids
soccer
field
decided
join
38
books
shelf
marta
put
10
pile
desk
each
candy
comes
package
15
added
sara
34
37
willie
birds
sitting
tree
21
flew
up
bananas
christopher
later
cards
store
angela
annie
pigs
barn
come
them
86
came
sarah
trucks
13
jeff
and
2
banana
isabel
900
paper
used
156
91
connie
73
juan
jack
33
rebecca
fence
total
edward
92
40
phillip
roger
blocks
mildred
collects
77
mildred's
father
ducks
swimming
lake
20
randy
uses
build
tower
mary
billy
52
isabella's
hair
is
inches
long
haircut
much
cut
off
jose
bottle
caps
martha
3
76
emily
owls
joined
55
deborah
susan
35
ruby
63
land
craig
5
sean
29
patricia
albert
our
class
54
library
we
23
get
marie
95
erasers
42
michael
fish
his
tank
ben
him
49
begin
mikey
356
leaves
blew
112
79
pencils
eric
charles
jessica
39
william
theresa
teresa
rachel
231
fly
312
nancy
carol
carol's
elisa
dollars
earn
53
helen
ann
anna
anna's
judy
eugene
clarence
99
students
school
first
bobby
bobby's
ralph's
gerald
puts
inside
beavers
working
their
home
1
went
for
swim
still
after
party
0.625
cake
over
that
night
big
eats
0.25
rosa
67
flowers
andre
90
carlos
kelly
nintendo
games
need
so
36
diane
frances
16
lucy
an
aquarium
212
wants
buy
68
would
jennifer
virginia
96
amy
shelby's
teacher
gold
stars
great
math
work
yesterday
shelby
earned
today
donald
norma
kimberly
janet
ruth
58
megan
217
markers
robert
109
nell
baseball
304
276
isha's
pencil
cubes
both
arthur
carolyn
47
farmer
127
neighbor
joyce
75
joshua
daniel
noodles
only
harold
stephanie
dan
$3.00
bar
$1.00
money
paul
28
strawberries
basket
picked
61
evelyn
henry
69
doris
christine
ronald
80
41
nathan
31
sharpens
it
sharpen
jovana
filled
bucket
pounds
shells
adds
shell
fill
peter
479
birthday
year
been
lost
or
given
heather
60
russell
sandy
26
pet
adam
51
wayne
wayne's
apple
molly
candles
grew
older
old
adolfo
made
65
add
32
janice
48
mark
trees
backyard
plants
heine
buying
valentine's
day
treats
dogs
heart
biscuits
tommy
balloons
mom
misha
jesse
harry
toucans
limb
toucan
joins
shawn
84
james
clown
$5.00
airplane
costs
$4.28
change
dog
louise
bruce
franklin
valentines
bridget
josh
collection
anthony
56
my
bones
dug
367
860
joseph
kathy
anne
denise
wanda
barbara
marvin
dennis
179
45
489
2778
together
marilyn
dorothy
hilt
cents
ate
eat
kevin
jonathan
aaron
jorge
scored
goals
playing
last
season
this
what
number
wong
30
linda
carson's
carson
paula
week
pat
during
kenneth
boys
down
slide
gary
spent
snake
barking
bark
todd
carrot
sticks
before
dinner
emily's
sister
121
tim
paid
brian
matthew
24
grow
seashells
find
280
81
lillian
lillian's
brandon
bonnie
tina
82
97
mariela
was
hospital
403
well
around
country
when
287
friends
family
nicholas
85
catherine
maria
jean
grows
be
142
katherine
183
593
looked
car's
odometer
trip
showed
traveled
212.3
miles
stopped
lunch
read
372.0
cade
dylan
joan
found
beach
sam
seashell
bales
hay
stacked
walnut
currently
park
workers
plant
finished
mike
peaches
roadside
fruit
dish
orchard
stock
pick
roses
vase
flower
garden
dimes
bank
dad
alyssa's
puppies
drawer
placed
rulers
jason
quarters
several
yard
sale
weekend
maple
sally
alyssa
tom
washed
make
washing
benny
oak
broken
unbroken
orange
fred
borrowed
joan's
cat
kittens
dogwood
mike's
violet
popular
scissors
keith
pennies
760
418
676
pokemon
224
jason's
107
104
709
green
221
115
100
orchid
bushes
watermelons
rabbits
nickels
melanie
fred's
potatoes
damaged
restaurant
hamburgers
serve
actually
served
took
limes
blue
43
's
pumpkins
sell
gathered
sold
mother
tomorrow
new
